; domain
(define
	(domain hanoi)
	(:requirements :adl)
	(:types disk rod)
	(:constants x y z - rod)
	(:predicates
		(mniejszy ?mniejszy ?wiekszy - disk)
		(napaliku ?palik - rod ?dysk - disk)
	)

	(:action przesun-na-pusty
		:parameters (?zpalika ?napalik - rod ?dysk - disk)
		:precondition
		(and
			(napaliku ?zpalika ?dysk)
			(not (exists (?innydysk - disk) (napaliku ?napalik ?innydysk)))
			(not (exists (?innydysk2 - disk) (and (mniejszy ?innydysk2 ?dysk) (napaliku ?zpalika ?innydysk2))))
		)
		:effect
		(and
			(napaliku ?napalik ?dysk)
			(not (napaliku ?zpalika ?dysk))
		)
	)
	(:action przesun
		:parameters (?zpalika ?napalik - rod ?dyskzpalika ?dysknapaliku - disk)
		:precondition
		(and
			(napaliku ?zpalika ?dyskzpalika)
			(napaliku ?napalik ?dysknapaliku)
			(not (exists (?innydysk - disk) (and (mniejszy ?innydysk ?dyskzpalika) (napaliku ?zpalika ?innydysk))))
			(not (exists (?innydysk2 - disk) (and (mniejszy ?innydysk2 ?dysknapaliku) (napaliku ?napalik ?innydysk2))))
			(mniejszy ?dyskzpalika ?dysknapaliku)
		)
		:effect
		(and
			(not (napaliku ?zpalika ?dyskzpalika))
			(napaliku ?napalik ?dyskzpalika)
		)
	)	
)

; problem
(define (problem p1)
	(:domain hanoi)
	(:objects d1 d2 d3 d4 d5 - disk)
	(:init
		(mniejszy d1 d2) 
		(mniejszy d1 d3)
		(mniejszy d1 d4)
		(mniejszy d1 d5)
		(mniejszy d2 d3)
		(mniejszy d2 d4)
		(mniejszy d2 d5)
		(mniejszy d3 d4)
		(mniejszy d3 d5)
		(mniejszy d4 d5)
		(napaliku x d1) 
		(napaliku x d2)
		(napaliku x d3)
		(napaliku x d4)
		(napaliku x d5)
	)
	(:goal 
		(and
			(napaliku z d1)
			(napaliku z d2)
			(napaliku z d3)
			(napaliku z d4)
			(napaliku z d5)
		)
	)
)

; plan
1. (przesun-na-pusty x z d1)
   deleted: (napaliku x d1)
   added: (napaliku z d1)
   goals met: 1 of 5
2. (przesun-na-pusty x y d2)
   deleted: (napaliku x d2)
   added: (napaliku y d2)
   goals met: 1 of 5
3. (przesun z y d1 d2)
   deleted: (napaliku z d1)
   added: (napaliku y d1)
   goals met: 0 of 5
4. (przesun-na-pusty x z d3)
   deleted: (napaliku x d3)
   added: (napaliku z d3)
   goals met: 1 of 5
5. (przesun y x d1 d4)
   deleted: (napaliku y d1)
   added: (napaliku x d1)
   goals met: 1 of 5
6. (przesun y z d2 d3)
   deleted: (napaliku y d2)
   added: (napaliku z d2)
   goals met: 2 of 5
7. (przesun x z d1 d2)
   deleted: (napaliku x d1)
   added: (napaliku z d1)
   goals met: 3 of 5
8. (przesun-na-pusty x y d4)
   deleted: (napaliku x d4)
   added: (napaliku y d4)
   goals met: 3 of 5
9. (przesun z y d1 d4)
   deleted: (napaliku z d1)
   added: (napaliku y d1)
   goals met: 2 of 5
10. (przesun z x d2 d5)
   deleted: (napaliku z d2)
   added: (napaliku x d2)
   goals met: 1 of 5
11. (przesun y x d1 d2)
   deleted: (napaliku y d1)
   added: (napaliku x d1)
   goals met: 1 of 5
12. (przesun z y d3 d4)
   deleted: (napaliku z d3)
   added: (napaliku y d3)
   goals met: 0 of 5
13. (przesun-na-pusty x z d1)
   deleted: (napaliku x d1)
   added: (napaliku z d1)
   goals met: 1 of 5
14. (przesun x y d2 d3)
   deleted: (napaliku x d2)
   added: (napaliku y d2)
   goals met: 1 of 5
15. (przesun z y d1 d2)
   deleted: (napaliku z d1)
   added: (napaliku y d1)
   goals met: 0 of 5
16. (przesun-na-pusty x z d5)
   deleted: (napaliku x d5)
   added: (napaliku z d5)
   goals met: 1 of 5
17. (przesun-na-pusty y x d1)
   deleted: (napaliku y d1)
   added: (napaliku x d1)
   goals met: 1 of 5
18. (przesun y z d2 d5)
   deleted: (napaliku y d2)
   added: (napaliku z d2)
   goals met: 2 of 5
19. (przesun x z d1 d2)
   deleted: (napaliku x d1)
   added: (napaliku z d1)
   goals met: 3 of 5
20. (przesun-na-pusty y x d3)
   deleted: (napaliku y d3)
   added: (napaliku x d3)
   goals met: 3 of 5
21. (przesun z y d1 d4)
   deleted: (napaliku z d1)
   added: (napaliku y d1)
   goals met: 2 of 5
22. (przesun z x d2 d3)
   deleted: (napaliku z d2)
   added: (napaliku x d2)
   goals met: 1 of 5
23. (przesun y x d1 d2)
   deleted: (napaliku y d1)
   added: (napaliku x d1)
   goals met: 1 of 5
24. (przesun y z d4 d5)
   deleted: (napaliku y d4)
   added: (napaliku z d4)
   goals met: 2 of 5
25. (przesun x z d1 d4)
   deleted: (napaliku x d1)
   added: (napaliku z d1)
   goals met: 3 of 5
26. (przesun-na-pusty x y d2)
   deleted: (napaliku x d2)
   added: (napaliku y d2)
   goals met: 3 of 5
27. (przesun z y d1 d2)
   deleted: (napaliku z d1)
   added: (napaliku y d1)
   goals met: 2 of 5
28. (przesun x z d3 d4)
   deleted: (napaliku x d3)
   added: (napaliku z d3)
   goals met: 3 of 5
29. (przesun-na-pusty y x d1)
   deleted: (napaliku y d1)
   added: (napaliku x d1)
   goals met: 3 of 5
30. (przesun y z d2 d3)
   deleted: (napaliku y d2)
   added: (napaliku z d2)
   goals met: 4 of 5
31. (przesun x z d1 d2)
   deleted: (napaliku x d1)
   added: (napaliku z d1)
   goals met: 5 of 5
